Revit 2026 API

# ModelPathGetProjectGUID Method

---

A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Guid GetProjectGUID()
```
```vb
Public Function GetProjectGUID As Guid
```
```cpp
public:
Guid GetProjectGUID()
```
```fsharp
member GetProjectGUID : unit -> Guid
```

#### Return Value

Guid

#### Reference

ModelPath Class

Autodesk.Revit.DB Namespace